{
    "slug": "beef-with-black-bean-sauce",
    "title": "Beef with Black Bean Sauce",
    "cover_image": "",
    "description": "In China, self-serving fast food restaurants are popular. They display all kinds of foods nicely on the counter—you just pick what you want. Today we’re making a common dish from these restaurants: 豉汁牛肉 (stir fry beef with black bean sauce). I got tons of requests for this recipe and today is the day.",
    "overview": "Stir fry beef with black bean sauce – tender beef with a punch of umami from fermented black beans.",
    "prep_time": "0 min.",
    "cook_time": "0 min.",
    "servings": "",
    "tags": ["Beef"],
    "ingredients": [
      {
        "title": "Marinade",
        "content": [
          "350 gram beef slices",
          "2 tsp soy sauce",
          "1/2 tsp salt",
          "1/2 tsp baking soda",
          "1 tsp grated garlic",
          "1 tsp grated ginger",
          "1 tsp cornstarch"
        ]
      },
      {
        "title": "Stir-Frying",
        "content": [
          "2.5 tbsp oil",
          "marinated Beef",
          "10 cloves garlic diced",
          "1.5 tbsp Chinese fermented black beans",
          "1/2 medium size onion",
          "1/2 red bell pepper",
          "1/2 green bell pepper"
        ]
      },
      {
        "title": "Sauce",
        "content": [
          "1 tbsp", 
          "1 tbsp", 
          "white pepper to taste",
          "1 cup beef stock"
        ]
      }
    ],
    "stages": [
      {
        "title": "Step 1",
        "content": [
          "Slice the beef thinly. Any tender cut like sirloin, ribeye, etc., works well—but note, this recipe uses beef chuck roast, a cheaper cut. I'll show you how to marinade and cook it to make it tender and juicy like restaurant-quality meat."
        ],
        "images": []
      },
      {
        "title": "Step 2",
        "content": [
          "Marinade the beef with 2 tsp of soy sauce, 1 tsp grated garlic, 1 tsp grated ginger, 1/2 tsp salt, 1/2 tsp baking soda, and 1 tsp cornstarch. Mix well, cover, and let sit for at least 30 minutes."
        ],
        "images": []
      },
      {
        "title": "Step 3",
        "content": [
          "While waiting, crush and dice 10 cloves of garlic. Yes, that's a lot, but it's why the dish is so flavorful."
        ],
        "images": []
      },
      {
        "title": "Step 4",
        "content": [
          "Dice the key ingredient: 豆豉 (Douchi), also known as fermented and salted black soybeans. Its sharp, pungent aroma adds umami. Roughly chop and set aside with the garlic."
        ],
        "images": []
      },
      {
        "title": "Step 5",
        "content": [
          "Prepare vegetables: halve a green bell pepper, a red bell pepper, add some carrot slices and onion slices. These colorful vegetables enhance the dish’s visual appeal."
        ],
        "images": []
      },
      {
        "title": "Step 6",
        "content": [
          "Quickly make a sauce by mixing 1 tbsp soy sauce, 1 tbsp oyster sauce, a dash of white pepper to taste, and 1 cup beef stock. Stir well."
        ],
        "images": []
      },
      {
        "title": "Step 7",
        "content": [
          "Heat your wok until slightly smoking. Add about 2.5 tbsp oil and swirl to coat the bottom. Add the beef in a single layer. Let it sear on one side until lightly charred, then stir-fry to cook the other side. Continue until you see nice charring on the edges, then remove the beef. Tilt the wok to let excess grease remain behind."
        ],
        "images": []
      },
      {
        "title": "Step 8",
        "content": [
          "With about 2 tsp oil remaining and crispy bits on the wok bottom, do not wash the wok. Add a bit more oil if needed and sauté the garlic and black beans at low heat until fragrant."
        ],
        "images": []
      },
      {
        "title": "Step 9",
        "content": [
          "Add all prepared vegetables to the wok. Stir-fry until they begin to soften. Then pour in the sauce to deglaze, scraping up all the flavorful bits. Once the sauce is bubbling, taste and adjust seasoning if necessary. Add cornstarch water (2 tsp cornstarch mixed with 1 tbsp water) and stir quickly to thicken the sauce."
        ],
        "images": []
      },
      {
        "title": "Step 10",
        "content": [
          "Return the beef to the wok. Mix everything until well combined and serve."
        ],
        "images": []
      }
    ],
    "notes": [],
    "link": "https://soupeduprecipes.com/stir-fry-beef-with-black-bean-sauce/"
  }
  